:PROPERTIES:
:ID:       b0f0bb3f-9b8b-4035-b45f-021299918711
:END:
#+title: Journals: Learning how to sysadmin
#+date: 2022-11-10 14:14:04 +08:00
#+date_modified: 2023-02-12 10:13:10 +08:00
#+language: en


* 2023-01-06

The server is back up and running!

I also added an Atuin sync server especially that I use more often now and slowly needing to sync the history.
While the sync server from the developer is nice, I decided at the end that I would like to manage it for a try.
Fortunately, the service is already available as a NixOS module so there's not much problem there.

Next up, I also replaced the OpenLDAP server to be managed with [[https://github.com/majewsky/portunus][Portunus]] which is already available as a NixOS module.
I haven't tried completely managing it yet, though.
I only scratched the very surface of managing and using LDAP.
I should find out more about it once I continued with my courses I previously mentioned in this journal.

There is another thing which is adding a new component in my server: a nice storage box.
Specifically, I added a storage box from Hetzner which is surprisingly cheap with €4 for a terabyte.
What's more, this storage box has some neat features including an SSH and Borg server.
This instantly replaces my decision to go with a Hetzner storage box instead of Borgbase which is nice but with the budget in mind, I get more mileage from Hetzner's offer.

A complete self-managed setup for €8 a month?
That is very nice especially with a budget.
I'm very satisfied with Hetzner so far.

Even with a meager job pay, my whole setup is quite cheap.
Here's a table of the expenses.

| Thing                    | Expenses (in EUR per month) |
|--------------------------+-----------------------------|
| Hetzner VPS              |                        5.35 |
| Hetzner storage box      |                         3.5 |
| mailbox.org account      |                           3 |
| foodogsquared.one domain |                           2 |
|--------------------------+-----------------------------|
| Total                    |                       13.85 |
#+TBLFM: @>$2=vsum(@I..@-I)


* 2023-01-19

Welp, decided to take a different approach to journalling.
Here's what I want to do and whether or not I completed it on time.

- [X] Configure systemd-networkd to properly configure network devices with automatic IPv6.
- [ ] Learn nftables for IP forwarding and additional Wireguard setup

I was not able to learn about nftables at time.
Most of the time, I've been trying to parse what is going on exactly with IP addresses and how to setup a networking setup with a system.
I found myself overwhelmed with the concepts of dynamically generating IPs which apparently has multiple ways to generate them which is especially true with IPv6 which is already something that I'm barely familiar with.

For a short recap, similarly to IPv4, IPv6 have assigned address ranges for private networks.
These interfaces are not going to generate and assign IP themselves, you still have to assign it.
However, you're dealing with IPv6.
Manually assigning IPv6 IPs is not often worth especially with subnetting.
And so there are ways to generate them...

- [[https://www.rfc-editor.org/rfc/rfc4862][Stateless Address Autoconfiguration (SLAAC)]] generates IP addresses by its nearby network links that are sending "Router Advertisement".
  No additional servers and manual configuration of hosts necessary.
  One neat thing with this is the process is decentralized, the minimal amount of changes to make, and only requiring local information.
  I recommend to stick to this.

- Good ol' DHCP server except for IPv6, referred to as [[https://www.rfc-editor.org/rfc/rfc3315][DHCPv6]].
  Simiarly, a request will be sent to the server and receives an address which can be used to automatically assign to a network link.
  While this can be nice for restricting what addresses can be published for that zone, it is centralized.
  Once the server has shut down, the network will likely fall as the IPs the links hold are dynamically configured.

One more thing: apparently, you can combine static and dynamically configured IP addresses.
I always thought it is only given a choice of static and dynamic IP configuration considering most interfaces I've interacted presents it this way (or at least my impressions of it).
It makes sense once you know that multiple addresses can be assigned to an interface and dynamically generated IPs have virtually no difference to distinguish themselves from statically assigned IPs.
It's just IPs on the way down.

I also discovered a valuable tool which I should've thought of at the beginning of my struggle understanding IPs: an IP calculator.
More specifically, [[https://gitlab.com/ipcalc/ipcalc][ipcalc]] because it is in the same environment you'll be configuring them networking setups anyway.

#+begin_src shell
nix run nixpkgs#ipcalc -- 2001:5eca:de53::3
#+end_src

#+results:
: Full Address:	2001:5eca:de53:0000:0000:0000:0000:0003
: Address:	2001:5eca:de53::3
: Address space:	Global Unicast


